LindezaGrey/ultrawatch/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM (T-Watch Ultra: 16 MB QSPI flash, 8 MB QSPI PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Watch app: dual-core, ample stack
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# JTAG/OCD-aware debug (on-chip JTAG, FreeRTOS-aware GDB)
CONFIG_ESP32S3_DEBUG_OCDAWARE=y
